# !/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
8. Дано число ( ). Определить полугодие, на которое приходится месяц c
номером и количество дней в том месяце (год не високосный).
"""

import sys

if __name__ == '__main__':
    m = int(input("Введите число месяца 2022 года: "))

    if m == 1:
        print("1 полугодие, 31 день")
    elif m == 2:
        print("1 полугодие, 28 дней")
    elif m == 3:
        print("1 полугодие, 31 день")
    elif m == 4:
        print("1 полугодие, 30 дней")
    elif m == 5:
        print("1 полугодие, 31 день")
    elif m == 6:
        print("1 полугодие, 30 дней")
    elif m == 7:
        print("2 полугодие, 31 день")
    elif m == 8:
        print("2 полугодие, 31 дней")
    elif m == 9:
        print("2 полугодие, 30 день")
    elif m == 10:
        print("2 полугодие, 31 дней")
    elif m == 11:
        print("2 полугодие, 30 день")
    elif m == 12:
        print("2 полугодие, 31 дней")
    else:
        print("Ошибка, нет такого количества месяцов", file=sys.stderr)
        exit(1)
        